{"pageProps":{"title":"Perfect Startup Team","content":"If you're long enough in the tech business, you should have heard a tale about 3H that every startup needs. In order for a startup to become successful it needs 3 founders:\n- a Hacker\n- a Hustler\n- a Hippie (they call it Hipster nowadays but don't follow the crowd)\n\nIf you think about this setup for a bit, this constellation will definitely start making sense.\n\nLet's see what every one of those `3H` actually entails.\n\n### A Hacker\nLet's start with the easiest one. A Hacker is your CTO - someone who will build the product, someone who cares about building cool products, someone who understands how to spend time efficiently.\n\nSome tend to spend too much time over optimizing the early stage product.\nScalability doesn't matter when you didn't find your product fit yet. When you over optimize too early in the process, you're wasting at least double the time by not executing on your idea, losing time on unnecessary bells and whistles before having found your product market fit.\n\nAs you may know, startup is all about the execution. The faster you can execute, the higher are the chances of your startup to become successful.\n\nSo a hacker should know how to `cut corners` in a smart way. There is a huge difference between your [MVP](https://en.wikipedia.org/wiki/Minimum_viable_product) and your end product.\n\nBuilding products is hard, building valuable products is even harder - that's exactly why every `hacker` needs a counterpart - `a hippie`.\n\n### A Hippie\nWho's a hippie you may ask. If you are too young and don't know who [Steve\nJobs](https://en.wikipedia.org/wiki/Steve_Jobs) was, I pity you and recommend you to start getting to know about him.\n\nUp to this date, I personally consider him to be the best `product person`\never - you can argue, I don't care.\n\nSo, if you haven't seen [The Lost Interview](https://vimeo.com/475108226) yet - do it now, you won't regret it.\n\nOne of the questions Steve was asked is [Are you a hippie or a nerd](https://www.youtube.com/watch?v=uf6TzOHO_dk) - so when the best `product person` of all time considered himself `a hippie`, we can assume that `a hippie` is your `CPO`.\n\n[Marty Cagan](https://svpg.com/our-team/#marty) - the founder of the [Silicon Valley Product Group](https://svpg.com/) has the best definition of a successful product - it emerges on the intersection of following three properties:\n- `Valuable` - Something that our customers will choose to use\n- `Usable` - Easy to figure out how to use\n- `Feasible` - Buildable using the technology stack and skills we have\n\nThe best products exist on the intersection of those three qualities.\n\n### A Hustler\nThis one is almost as clear as `a hacker` position. Your hustler is your `Head of Sales`. A very important person on your team. Don't be disillusioned - [build it and they will come](https://samuelmullen.com/articles/startup-fallacies-if-you-build-it-they-will-come/) is a fallacy. In the world full of similar products and never ending competition, you need `a hustler` who will sell your product to your customers and your idea to the investors.\n\nThis is the person who knows and believes in your product and help `a hippie` to find the best possible [Product/market fit](https://en.wikipedia.org/wiki/Product/market_fit).\n\n### On A Side-note\n- Ideas are worth nothing without execution\n- Your customers do not care about your tech\n- Startup is a marathon not a sprint - pace yourself\n- Timing matters but you cannot control it\n- You don't know how your product will be used\n- It will be harder than you think\n"},"__N_SSG":true}